benchmark-results/hostb-rust-search-heavy.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /b/search-heavy.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 100 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 100/100 VUs, 107 complete and 0 interrupted iterations
default   [   1% ] 100 VUs  0m00.5s/1m0s

running (0m02.0s), 100/100 VUs, 338 complete and 0 interrupted iterations
default   [   2% ] 100 VUs  0m01.5s/1m0s

running (0m03.0s), 100/100 VUs, 591 complete and 0 interrupted iterations
default   [   4% ] 100 VUs  0m02.5s/1m0s

running (0m04.0s), 100/100 VUs, 820 complete and 0 interrupted iterations
default   [   6% ] 100 VUs  0m03.5s/1m0s

running (0m05.0s), 100/100 VUs, 1079 complete and 0 interrupted iterations
default   [   7% ] 100 VUs  0m04.5s/1m0s

running (0m06.0s), 100/100 VUs, 1313 complete and 0 interrupted iterations
default   [   9% ] 100 VUs  0m05.5s/1m0s

running (0m07.0s), 100/100 VUs, 1571 complete and 0 interrupted iterations
default   [  11% ] 100 VUs  0m06.5s/1m0s

running (0m08.0s), 100/100 VUs, 1842 complete and 0 interrupted iterations
default   [  12% ] 100 VUs  0m07.5s/1m0s

running (0m09.0s), 100/100 VUs, 2105 complete and 0 interrupted iterations
default   [  14% ] 100 VUs  0m08.5s/1m0s

running (0m10.0s), 100/100 VUs, 2381 complete and 0 interrupted iterations
default   [  16% ] 100 VUs  0m09.5s/1m0s

running (0m11.0s), 100/100 VUs, 2646 complete and 0 interrupted iterations
default   [  17% ] 100 VUs  0m10.5s/1m0s

running (0m12.0s), 100/100 VUs, 2890 complete and 0 interrupted iterations
default   [  19% ] 100 VUs  0m11.5s/1m0s

running (0m13.0s), 100/100 VUs, 3146 complete and 0 interrupted iterations
default   [  21% ] 100 VUs  0m12.5s/1m0s

running (0m14.0s), 100/100 VUs, 3415 complete and 0 interrupted iterations
default   [  22% ] 100 VUs  0m13.5s/1m0s

running (0m15.0s), 100/100 VUs, 3699 complete and 0 interrupted iterations
default   [  24% ] 100 VUs  0m14.5s/1m0s

running (0m16.0s), 100/100 VUs, 3966 complete and 0 interrupted iterations
default   [  26% ] 100 VUs  0m15.5s/1m0s

running (0m17.0s), 100/100 VUs, 4231 complete and 0 interrupted iterations
default   [  27% ] 100 VUs  0m16.5s/1m0s

running (0m18.0s), 100/100 VUs, 4500 complete and 0 interrupted iterations
default   [  29% ] 100 VUs  0m17.5s/1m0s

running (0m19.0s), 100/100 VUs, 4751 complete and 0 interrupted iterations
default   [  31% ] 100 VUs  0m18.5s/1m0s

running (0m20.0s), 100/100 VUs, 5019 complete and 0 interrupted iterations
default   [  32% ] 100 VUs  0m19.5s/1m0s

running (0m21.0s), 100/100 VUs, 5297 complete and 0 interrupted iterations
default   [  34% ] 100 VUs  0m20.5s/1m0s

running (0m22.0s), 100/100 VUs, 5582 complete and 0 interrupted iterations
default   [  36% ] 100 VUs  0m21.5s/1m0s

running (0m23.0s), 100/100 VUs, 5838 complete and 0 interrupted iterations
default   [  37% ] 100 VUs  0m22.5s/1m0s

running (0m24.0s), 100/100 VUs, 6117 complete and 0 interrupted iterations
default   [  39% ] 100 VUs  0m23.5s/1m0s

running (0m25.0s), 100/100 VUs, 6394 complete and 0 interrupted iterations
default   [  41% ] 100 VUs  0m24.5s/1m0s

running (0m26.0s), 100/100 VUs, 6660 complete and 0 interrupted iterations
default   [  42% ] 100 VUs  0m25.5s/1m0s

running (0m27.0s), 100/100 VUs, 6926 complete and 0 interrupted iterations
default   [  44% ] 100 VUs  0m26.5s/1m0s

running (0m28.0s), 100/100 VUs, 7185 complete and 0 interrupted iterations
default   [  46% ] 100 VUs  0m27.5s/1m0s

running (0m29.0s), 100/100 VUs, 7461 complete and 0 interrupted iterations
default   [  47% ] 100 VUs  0m28.5s/1m0s

running (0m30.0s), 100/100 VUs, 7739 complete and 0 interrupted iterations
default   [  49% ] 100 VUs  0m29.5s/1m0s

running (0m31.0s), 100/100 VUs, 8018 complete and 0 interrupted iterations
default   [  51% ] 100 VUs  0m30.5s/1m0s

running (0m32.0s), 100/100 VUs, 8295 complete and 0 interrupted iterations
default   [  52% ] 100 VUs  0m31.5s/1m0s

running (0m33.0s), 100/100 VUs, 8562 complete and 0 interrupted iterations
default   [  54% ] 100 VUs  0m32.5s/1m0s

running (0m34.0s), 100/100 VUs, 8825 complete and 0 interrupted iterations
default   [  56% ] 100 VUs  0m33.5s/1m0s

running (0m35.0s), 100/100 VUs, 9090 complete and 0 interrupted iterations
default   [  57% ] 100 VUs  0m34.5s/1m0s

running (0m36.0s), 100/100 VUs, 9340 complete and 0 interrupted iterations
default   [  59% ] 100 VUs  0m35.5s/1m0s

running (0m37.0s), 100/100 VUs, 9620 complete and 0 interrupted iterations
default   [  61% ] 100 VUs  0m36.5s/1m0s

running (0m38.0s), 100/100 VUs, 9899 complete and 0 interrupted iterations
default   [  62% ] 100 VUs  0m37.5s/1m0s

running (0m39.0s), 100/100 VUs, 10167 complete and 0 interrupted iterations
default   [  64% ] 100 VUs  0m38.5s/1m0s

running (0m40.0s), 100/100 VUs, 10428 complete and 0 interrupted iterations
default   [  66% ] 100 VUs  0m39.5s/1m0s

running (0m41.0s), 100/100 VUs, 10708 complete and 0 interrupted iterations
default   [  67% ] 100 VUs  0m40.5s/1m0s

running (0m42.0s), 100/100 VUs, 10976 complete and 0 interrupted iterations
default   [  69% ] 100 VUs  0m41.5s/1m0s

running (0m43.0s), 100/100 VUs, 11225 complete and 0 interrupted iterations
default   [  71% ] 100 VUs  0m42.5s/1m0s

running (0m44.0s), 100/100 VUs, 11466 complete and 0 interrupted iterations
default   [  72% ] 100 VUs  0m43.5s/1m0s

running (0m45.0s), 100/100 VUs, 11734 complete and 0 interrupted iterations
default   [  74% ] 100 VUs  0m44.5s/1m0s

running (0m46.0s), 100/100 VUs, 12005 complete and 0 interrupted iterations
default   [  76% ] 100 VUs  0m45.5s/1m0s

running (0m47.0s), 100/100 VUs, 12271 complete and 0 interrupted iterations
default   [  77% ] 100 VUs  0m46.5s/1m0s

running (0m48.0s), 100/100 VUs, 12549 complete and 0 interrupted iterations
default   [  79% ] 100 VUs  0m47.5s/1m0s

running (0m49.0s), 100/100 VUs, 12819 complete and 0 interrupted iterations
default   [  81% ] 100 VUs  0m48.5s/1m0s

running (0m50.0s), 100/100 VUs, 13076 complete and 0 interrupted iterations
default   [  82% ] 100 VUs  0m49.5s/1m0s

running (0m51.0s), 100/100 VUs, 13330 complete and 0 interrupted iterations
default   [  84% ] 100 VUs  0m50.5s/1m0s

running (0m52.0s), 100/100 VUs, 13580 complete and 0 interrupted iterations
default   [  86% ] 100 VUs  0m51.5s/1m0s

running (0m53.0s), 100/100 VUs, 13861 complete and 0 interrupted iterations
default   [  87% ] 100 VUs  0m52.5s/1m0s

running (0m54.0s), 100/100 VUs, 14138 complete and 0 interrupted iterations
default   [  89% ] 100 VUs  0m53.5s/1m0s

running (0m55.0s), 100/100 VUs, 14412 complete and 0 interrupted iterations
default   [  91% ] 100 VUs  0m54.5s/1m0s

running (0m56.0s), 100/100 VUs, 14678 complete and 0 interrupted iterations
default   [  92% ] 100 VUs  0m55.5s/1m0s

running (0m57.0s), 100/100 VUs, 14948 complete and 0 interrupted iterations
default   [  94% ] 100 VUs  0m56.5s/1m0s

running (0m58.0s), 100/100 VUs, 15202 complete and 0 interrupted iterations
default   [  96% ] 100 VUs  0m57.5s/1m0s

running (0m59.0s), 100/100 VUs, 15444 complete and 0 interrupted iterations
default   [  97% ] 100 VUs  0m58.5s/1m0s

running (1m00.0s), 100/100 VUs, 15710 complete and 0 interrupted iterations
default   [  99% ] 100 VUs  0m59.5s/1m0s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.02' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 31882   524.648752/s
    checks_succeeded...: 100.00% 31882 out of 31882
    checks_failed......: 0.00%   0 out of 31882

    ✓ search hit 200
    ✓ search miss 200

    HTTP
    http_req_duration..............: avg=161.94ms med=149.54ms p(95)=299.36ms p(99)=399.28ms
      { expected_response:true }...: avg=161.94ms med=149.54ms p(95)=299.36ms p(99)=399.28ms
    http_req_failed................: 0.00%  0 out of 32082
    http_reqs......................: 32082  527.939943/s

    EXECUTION
    iteration_duration.............: avg=377.31ms med=389.5ms  p(95)=605.85ms p(99)=704.33ms
    iterations.....................: 15941  262.324376/s
    vus............................: 100    min=100        max=100
    vus_max........................: 100    min=100        max=100

    NETWORK
    data_received..................: 10 MB  165 kB/s
    data_sent......................: 2.7 MB 45 kB/s



running (1m00.8s), 000/100 VUs, 15941 complete and 0 interrupted iterations
default ✓ [ 100% ] 100 VUs  1m0s